/******************************************************************Обозначения*********************************************************************************/

// Определяем пины, к которым будем подключать шим-входы контроллера мотора
#define MOTOR_PWM_PIN_1 0   // Подключаем к GP19 - 25 ножка микроконтроллера
#define MOTOR_PWM_PIN_2 1   // Подключаем к GP2 - 4 ножка микроконтроллера
//#define MOTOR_PWM_PIN_3 18  // Подключаем к GP18 - 24 ножка микроконтроллера
//#define MOTOR_PWM_PIN_4 0   // Подключаем к GP0 - 1 ножка микроконтроллера


#define DIR_PIN_1 2
#define DIR_PIN_2 3
//#define DIR_PIN_3 16
//#define DIR_PIN_4 22
// Определяем предделитель тактовой частоты микроконтроллера (133Мгц) - один для всех шим-каналов. Не может быть больше 256!!!
#define MOTOR_PWM_DIV 65
// Определяем число тиков, через которое таймер будет сброшен. От этого числа будет зависеть точность установки скважности импульсов(чем больше, тем выше точность)
#define MOTOR_PWM_WRAP 100
// Заметим, что при таких настройках частота шима 133 000 000/6500 = 20.46 Кгц, что необходимо для работы драйвера мотора

/***************************************************************Библиотечные функции***************************************************************************/

void motors_init();
void motors_direction_init();
void motors_pwm_init();

void motor1_controller(int speed);
void motor2_controller(int speed);
// void motor3_controller(int speed);
// void motor4_controller(int speed);
