// Copyright (c) 2021 Juan Miguel Jimeno
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
/**
  * @brief  Функция ПИД-регулирования.
  *
  *	@note   Обратите внимание, что функция должна вызываться периодически с частотой Reg_Freq. Удобнее всего сделать
  *			это при помощи прерывания по таймеру
  *
  * @param	setpoint				-- Значение уставки (желаемого выходного значения регулируемой системы)
  *
  * @param	measured_val			-- Значение фактически измеренного сигнала на выходе из регулируемой системы
  *
  *@param	dt			            -- Промежуток времени интегрирования и дифференциирования
  * 
  * @retval float				    -- Значение с учетом ошибок, подаваемое на вход регулируемой системы (PID out)
  *
  * @note   Обратите внимание, что по умолчанию проверка на максимальное выходное значение отключена
  *
  *
  *                 Принципиальная схема подключения блока ПИД-регулировки
  *
  *  		    Блок ПИД-регулировки
  *           . . . . . . . . . . . . .
  *          :    ___        _______   :          ______________________
  * setpoint :   /   \  err |       |  : PID out |                      | measured_val
  * ---------:--|  -  |-----|  PID  |--:---------| Регулируемая система |---------------
  *          :   \___/      |_______|  :         |______________________|              |
  *          :     |                   :                                               |
  *          :     |___________________:_______________________________________________|
  *           . . . . . . . . . . . . .
  */



#include "pid.h"

PID::PID(float min_val, float max_val, float kp, float ki, float kd):
    min_val_(min_val),
    max_val_(max_val),
    kp_(kp),
    ki_(ki),
    kd_(kd)
{
}

float PID::compute( float setpoint, float measured_val, float dt){
//Разница уставки и измеренного значения, используется при вычислении пропорциональной компоненты регулятора	
    float err = setpoint - measured_val;					

//Сбрасываем ошибки при остановке системы
    if(setpoint == 0 && err == 0)
    {
        integral_ = 0;
        derivative_ = 0;
    }
//Считаем интегральную ошибку и накапливаем ее в переменной integral_, проверяя, входит ли она в допустимый диапазон значений
//TODO здесь интеграл считается методом треугольников, но также можно считать методом трапеций. Скорее всего увеличится точность, а скорость рассчета не сильно поменяется
	integral_ = integral_ + err*dt*ki_;
//Считаем дифференциальную ошибку
	derivative_ = (err - prev_error_)/dt;
	prev_error_ = err;
//Возвращаем значение с выхода блока ПИД-регулятора (PID out, оно же подается на вход регулируемой системы)
	float pid = kp_*err +  integral_ + kd_*derivative_;
    return (pid > max_val_) ? max_val_ : ((pid < min_val_) ? min_val_ : pid);
}

void PID::updateConstants(float kp, float ki, float kd)
{
    kp_ = kp;
    ki_ = ki;
    kd_ = kd;
}


/** Рекомендации по вычислению коэффициентов (Карпов В.Э. ПИД-управление в нестрогом изложении):
  * 1)Kp -- Установим сначала маленькое значение kp. Допустим, колебаний еще нет. Далее увеличиваем это значение в 10 раз,
  * пока не начнутся колебания. Теперь уменьшаем значение коэффициента kp, но не в 10 раз, а в 2 раза. И так до тех
  * пор, пока колебания не прекратятся.
  *
  * 2)Kd -- Значение коэффициента интегральной компоненты ki должно быть мало по сравнению c kp. В качестве начального
  * значения коэффициента ki рекомендуется брать число от 0.0001 до 0.01. Процедура поиска (подбора) коэффициента ki
  * точно такая же, как и kp. Слишком большое значение коэффициента ki также проявляется в появлении колебаний.
  *
  * 3)Ki -- Если мы уверены, что шумы в нашей системе на слишком велики, то можно ввести и дифференциальную компоненту.
  * Для настройки kd установим сначала значение этого коэффициента, равное 0. Далее установим какое-нибудь небольшое
  * значение kp (например, kp =1). Главное, что значение kp должно быть таким, чтобы система при нулевом значении kd
  * не совершала колебаний. Далее установим какое-нибудь небольшое начальное значение kd (например, kd =0.1). Будем
  * увеличивать коэффициент kd до тех пор, пока не станут проявляться ошибочные колебания, вызванные малыми шумами.
  * При этом колебания от слишком большого коэффициента происходят значительно быстрее, чем колебания от недостаточного
  * коэффициента. Рекомендуется устанавливать коэффициент в половину или четверть от того, при котором начинаются
  * колебания от слишком большой его величины.
  *
  * Метод Цинглера-Никольса:
  * 1) Обнуляем все коэффициенты регулятора.
  * 2) Задаем некоторое целевое значение регулируемого параметра (например, температуры).
  * 3) Постепенно начинаем увеличивать пропорциональный коэффициент и следим за реакцией системы. При определенном
  * значении kp возникнут незатухающие колебания регулируемой величины.
  * 4) Фиксируем это значение, а также период колебаний системы.
  * 5) Коэффициенты вычисляем по формулам:
  * 	kp := 0.6 * k0
  * 	ki := 2 * kp / T
  * 	kd = kp * T / 8
  */


